In [2]:
import sqlite3
import pandas as pd
# import STAT5102_2023 as ct # common tools

In [15]:
# Connect to the SQLite database
con = sqlite3.connect("Topic1_dataset (1).sqlite")

# Create a cursor to execute SQL commands
cur = con.cursor()

In [16]:
# # Connect to the SQLite database
# con = sqlite3.connect("Topic1_dataset.sqlite")

# # Create a cursor to execute SQL commands
# cur = con.cursor()
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cur.fetchall()
tables

[('sqlite_sequence',), ('products',), ('purchase',), ('sales',), ('shops',)]

## Preview tables

In [17]:
def get_pd_dataframe(query, connection):
    return pd.read_sql_query(query, connection)

1. 9781338896459 - Dog Man #13: Big Jim Begins (HB)
2. 9781338896398 - Cat Kid Comic Club #5: Influencers (HB)
3. 9789814918015 & 9781338347258 & 9789810950286 -
Captain Underpants #12: Captain Underpants and the
Sensational Saga of Sir Stinks-A-Lot
4. 9781529097160 - Andy Griffiths: The 169 Storey
Treehouse (PB)
5. 9781913484552 - Guinness World Records 2025
6. 9781913484521 - Guinness World Records Gamer’s
Edition 2025

In [43]:
products_preview = get_pd_dataframe("SELECT * FROM products;", con)
products_preview

,product,title,price,book_original_price,barcode,barcode2,isbn
0,000737108X,David Walliams - Billionaire Boy,112.0,115.00,9780007371082,9780007371082,None
1,006445083X,Let's Read-and-Find-Out - Science (S-1): My Fi...,59.9,59.90,9780064450836,9780064450836,None
2,01091,University Games: Captain Underpants Rip Roari...,199.0,199.00,794764010916,794764010916,01091
3,01093,Univeristy Games: Captain Underpants Sign Chan...,149.0,149,794764010930,794764010930,01093
4,0140563784,Eric Carle - From Head to Toe,112.0,99.90,9780140563788,9780140563788,None
...,...,...,...,...,...,...,...
2300,DOGMAN#12,PreOrder Dog Man #12: Scarlet Shedder,89.0,89.00,DOGMAN#12,DOGMAN#12,None
2301,GUINNESSWR2025,Pre-Order: Guinness World Records 2025,199.0,199.00,GUINNESSWR2025,GUINNESSWR2025,None
2302,PREORDER,Pre-order: Dog Man #9 Crime and Punishment (97...,0.0,None,000640,000640,SPECIAL PRICE
2303,PREORDER-01,Pre-order: 130 Storey Treehouse (9781529017922),0.0,89.00,None,000719,None
2304,PREORDER-03,Pre-order: Dog Man #10 Mothering Heights (9781...,0.0,None,000728,000728,None

In [ ]:
products_preview

In [23]:
purchase_preview = get_pd_dataframe("SELECT * FROM purchase limit 5;", con)
purchase_preview

,invoice,product,quantity,trandate,price,discount,disc_amt,amount
0,30002922,9781445489155,111,2014-01-03 00:00:00.000,8.1640,0,0,906.204
1,30002923,9789888155408,3000,2014-01-03 00:00:00.000,2.4000,0,0,7200.000
2,30002922,9781445414683,96,2014-01-03 00:00:00.000,11.3825,0,0,1092.720
3,30002923,9789888155392,3000,2014-01-03 00:00:00.000,2.4000,0,0,7200.000
4,30002922,9781781860373,144,2014-01-03 00:00:00.000,8.2425,0,0,1186.920

In [44]:
sales_preview = get_pd_dataframe("SELECT * FROM sales where discount <> 0;", con)

In [45]:
sales_preview.head()

,channel,location,invoice,clients,product,quantity,trandate,price,discount,disc_amt,amount
0,Retail,04,067888,2B2190,0746066724,1,2014-01-01 00:00:00.000,29.9,5.0,0.0,28.4
1,Retail,04,067888,2B2190,0746066740,1,2014-01-01 00:00:00.000,29.9,5.0,0.0,28.4
2,Retail,04,067888,2B2190,9781743469590,1,2014-01-01 00:00:00.000,29.9,5.0,0.0,28.4
3,Retail,04,067888,2B2190,9781743469606,1,2014-01-01 00:00:00.000,29.9,5.0,0.0,28.4
4,Retail,04,067888,2B2190,9781743469613,1,2014-01-01 00:00:00.000,29.9,5.0,0.0,28.4

In [40]:
df_merged_4 = pd.read_csv('./data/merged4.csv')

In [ ]:
df_merged_4[df_merged_4['isbn'] like %988%].head()

,isbn,title,publisher,publication_date,book_format,reading_age,print_length,item_weight,length,width,height,rating,number_of_reviews,price,best_sellers_rank,customer_reviews
0,9780062381910,My Five Senses (Let's-Read-and-Find-Out Scienc...,harper_collins,2015-08-04,hardcover,toddler,32.0,12.0,10.00,8.00,0.38,4.8,1242.0,14.06,272594.0,4.8
1,9781409305996,Peppa Pig: Peppa Plays Football,ladybird,2000-01-01,hardcover,toddler,16.0,0.7,7.99,7.91,0.08,4.5,121.0,4.93,NaN,4.5

In [49]:
df_merged_4[df_merged_4['isbn'].astype(str).str.startswith('988')].head()

Empty DataFrame
Columns: [isbn, title, publisher, publication_date, book_format, reading_age, print_length, item_weight, length, width, height, rating, number_of_reviews, price, best_sellers_rank, customer_reviews]
Index: []

In [42]:
sales_preview.head(1)

,channel,location,invoice,clients,product,quantity,trandate,price,discount,disc_amt,amount
0,Retail,09,012245,None,1450810063,1,2014-01-01 00:00:00.000,198.0,0.0,0.0,198.0

In [25]:
shops_preview = get_pd_dataframe("SELECT * FROM shops limit 5;", con)
shops_preview

,location,shopname,isactive,shopadd1,shopadd2,shopadd3,shopadd4
0,01,OFFICE,Y,Active Minds Ltd.,"Blk A, 6/F., Tai Ping Industrial Park,","51 Ting Kok Road,","Tai Po, N.T."
1,02,BOOK FAIR,Y,Active Minds Ltd.,Tel: (852) 2690-4766,None,None
2,03,BOOK CASTLE-OT,Y,Book Castle - OT,"OT G45-G46, G/F, Ocean Terminal","Harbour City, Kowloon.",Tel: 2737 2343 Fax: 2737 2344
3,04,BOOK BUDDY - WH,Y,Book Buddy - WH,"Shop 208, 2/F., Windsor House,","311 Gloucester Road, CWB, H.K.",Tel: 2376 2230 Fax: 2376 2280
4,05,School Bookfair,Y,Active Minds Ltd.,Tel: (852) 2690-4766,Fax: (852) 2690-3422,None

In [32]:
# sqlite_sequence_preview = get_pd_dataframe("SELECT * FROM sqlite_sequence limit 5;", con)
# sqlite_sequence_preview

In [27]:
purchase_preview = get_pd_dataframe("SELECT * FROM purchase limit 5;", con)
purchase_preview

,invoice,product,quantity,trandate,price,discount,disc_amt,amount
0,30002922,9781445489155,111,2014-01-03 00:00:00.000,8.1640,0,0,906.204
1,30002923,9789888155408,3000,2014-01-03 00:00:00.000,2.4000,0,0,7200.000
2,30002922,9781445414683,96,2014-01-03 00:00:00.000,11.3825,0,0,1092.720
3,30002923,9789888155392,3000,2014-01-03 00:00:00.000,2.4000,0,0,7200.000
4,30002922,9781781860373,144,2014-01-03 00:00:00.000,8.2425,0,0,1186.920

In [30]:
purchase_preview.columns

Index(['invoice', 'product', 'quantity', 'trandate', 'price', 'discount',
       'disc_amt', 'amount'],
      dtype='object')

In [31]:
purchase_preview = get_pd_dataframe("SELECT product, quantity FROM purchase where product = '9781445489155' ;", con)
purchase_preview

         product  quantity
0  9781445489155       111

In [33]:
purchase = get_pd_dataframe("SELECT * FROM purchase;", con)

In [38]:
purchase.groupby('product').sum('quantity')

            quantity      price  discount    disc_amt       amount
product
000737108X       526  1146.7246    1015.0   7018.8656   11947.4854
006445083X        10    47.0215      75.0      0.0000     117.5145
01091             90    78.5000      35.0      0.0000    4592.2500
01093             60    58.8750      35.0      0.0000    2296.1250
0140563784      3356  1055.5846     730.0  80948.7972  102082.6368
...              ...        ...       ...         ...          ...
9888155202     16860   108.0000       0.0      0.0000  297700.0000
9888155210     10802    90.0000       0.0      0.0000  192119.0000
9888155229      8040    53.0000       0.0      0.0000  142200.0000
AS45813          600    14.6010       0.0      0.0000    4286.1000
CD-103022          2    27.3965      65.0      0.0000      19.1540

[1602 rows x 5 columns]

In [36]:
purchase[purchase['product'] == '9781529017571']

,invoice,product,quantity,trandate,price,discount,disc_amt,amount
6151,30006805,9781529017571,20,2019-12-05 00:00:00.000,80.3850,70.0,0.0000,482.3100
6492,30007088,9781529017571,20,2020-10-20 00:00:00.000,80.3850,65.0,0.0000,562.6950
6639,30007174,9781529017571,550,2021-01-07 00:00:00.000,80.3850,65.0,0.0000,15474.0550
7001,30007305,9781529017571,800,2021-08-04 00:00:00.000,80.3850,65.0,0.0000,22507.8000
7574,30007542,9781529017571,530,2022-08-31 00:00:00.000,91.8850,65.0,0.0000,17044.6100
8028,30007761,9781529017571,300,2023-08-18 00:00:00.000,91.8850,65.0,17917.5750,9647.9250
8042,30007773,9781529017571,300,2023-08-22 00:00:00.000,91.8850,60.0,16539.3000,11026.2000
8046,30007773,9781529017571,250,2023-08-22 00:00:00.000,91.8850,60.0,13782.7500,9188.5000
8070,30007803,9781529017571,550,2023-10-01 00:00:00.000,80.0598,65.0,28621.3284,15411.5616
8333,30008048,9781529017571,450,2024-09-12 00:00:00.000,80.0598,65.0,23417.4414,12609.4686
8335,30008048,9781529017571,1,2024-09-12 00:00:00.000,0.0000,0.0,0.0000,0.0000
8558,30008316,9781529017571,30,2025-07-02 00:00:00.000,90.0798,68.0,1837.6680,864.7260
8602,30008368,9781529017571,490,2025-08-19 00:00:00.000,90.0798,65.0,28690.4664,15448.6356